import random

first_names = ["Александр", "Дмитрий", "Максим", "Алексей", "Сергей", "Антон", "Николай", "Михаил", "Юрий", "Павел", 
         "Владимир", "Евгений", "Илья", "Роман", "Артем", "Вячеслав", "Василий", "Андрей", "Владислав", "Арсений", 
         "Тимофей", "Олег", "Денис", "Глеб", "Кирилл"]
second_names = ["Иванов", "Смирнов", "Кузнецов", "Попов", "Васильев", "Петров", "Соколов", "Михайлов", "Новиков", "Федоров", 
            "Морозов", "Волков", "Алексеев", "Лебедев", "Семенов", "Егоров", "Павлов", "Козлов", "Степанов", "Николаев", 
            "Орлов", "Макаров", "Захаров", "Зайцев", "Сидоров"]
third_names = ["Иванович", "Петрович", "Сергеевич", "Владимирович", "Андреевич", "Алексеевич", "Павлович", "Романович", 
               "Викторович", "Михайлович", "Иванович", "Дмитриевич", "Антонович", "Алексеевич", "Юрьевич", "Евгеньевич", 
               "Владиславович", "Геннадьевич", "Борисович", "Степанович", "Максимович", "Игоревич", "Константинович", 
               "Львович", "Федорович"]
countries = ["Россия", "США", "Канада", "Германия", "Франция", "Италия", "Испания", "Китай", "Япония", "Великобритания", 
             "Австралия", "Бразилия", "Индия", "Мексика", "Аргентина", "Швеция", "Норвегия", "Швейцария", "Нидерланды", 
             "Бельгия", "Южная Корея", "Турция", "Египет", "Израиль", "Саудовская Аравия"]

#############################################_________GENERATE_PASSPORT_________#############################################

ser_passport = {i: random.randint(1000, 9999) for i in range(25)}
num_passport = {i: random.randint(100000, 999999) for i in range(25)}

combined_passport = {ser_passport[key]: num_passport[key] for key in ser_passport}


#############################################_________GENERATE_FIO_________#############################################

def generate_random_fio(num):
    result = []
    passport_keys = list(combined_passport.keys())
    
    while len(result) < num:
        fio = (
            random.choice(second_names),
            random.choice(first_names),
            random.choice(third_names),
            random.choice(countries),
            random.choice(passport_keys),
            combined_passport[random.choice(passport_keys)]
        )
        result.append(fio)
    return result